# AnalyticalDiscrepancyWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalDiscrepancyWarning Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Distance between Analytical and Physical Models of Structural Element is beyond tolerance of [Value]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalDiscrepancyWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalDiscrepancyWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalDiscrepancyWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace